FemDesign.Loads.LoadCombinationTable
Class for combining load cases and storing load combinations

FemDesign.Loads.LoadCombinationTable.LoadCombinations
List of load combinations in collection

FemDesign.Loads.LoadCombinationTable.#ctor
Constructor

FemDesign.Loads.LoadCombinationTable.AddLoadCombination(FemDesign.Loads.LoadCombination)
Adds load combinations if not already present in LoadCombinations

FemDesign.Loads.LoadCombinationTable.CreateLoadCombination(System.Collections.Generic.List{FemDesign.Loads.ModelLoadCaseInGroup},System.Int32,System.String,System.Collections.Generic.List{FemDesign.Loads.LoadGroupPermanent},FemDesign.Loads.ELoadCombinationType)
Creates an instance of LoadCombination from the load cases in temporaryLoadCases,
the first load case is the leading action.
temporaryLoadCases: List of permanent load cases to be included in the combination
loadCombNumber: The index of the combination
loadCombinationNameTag: The name tag used for naming the combination
permanentLoadGroups: List of permanent load groups
combinationType: Type of loda combination ELoadCombinationType
Returns:

FemDesign.Loads.LoadCombinationTable.LoadCombinationType(FemDesign.Loads.ELoadCombinationType)
Converts the Enum combination type to string
combinationType:
Returns: The combination type as a string

FemDesign.Loads.LoadCombinationTable.PermuteLoadCases``1(System.Collections.Generic.List{``0})
Finds all combinations, where load cases from the first group are leading actions, from the provided loadGroups,
by selecting one case from each group
loadGroups:
Returns: Two nested lists with load cases and their associated load groups, where each element in the out list is a list with load cases or groups

FemDesign.Loads.LoadCombinationTable.GenerateLoadCombinations(System.Collections.Generic.List{FemDesign.Loads.LoadGroupBase},System.String,FemDesign.Loads.ELoadCombinationType)
Combines the load cases in the list of load groups provided
loadGroups:
loadCombinationNameTag:
combinationType:
Returns: Returns a list of instances of load combinations and the set of all load cases used

FemDesign.Loads.LoadCombinationTable.CreateLoadCasePermutations(System.Collections.Generic.List{FemDesign.Loads.LoadGroupTemporary})
Finds all permutations of load cases by letting all temporary load groups be the leading action once
temporaryLoadGroups: The load groups that hold the load cases to permute
Returns: A list with lists of load cases, with the first load case being the leading action

FemDesign.Loads.LoadCombinationTable.AddPermanentLoadCases``1(System.Collections.Generic.List{``0},System.Collections.Generic.List{FemDesign.Loads.LoadCase},FemDesign.Loads.ELoadCombinationType,System.Collections.Generic.List{System.Double})
Adds the load cases in permanentLoadGroups to loadCases and computes associated load coefficients
permanentLoadGroups:
loadCases:
combinationType:
loadCombGammas:

FemDesign.Loads.LoadCombinationTable.AddTemporaryLoadCases(System.Collections.Generic.List{FemDesign.Loads.ModelLoadCaseInGroup},FemDesign.Loads.ELoadCombinationType,System.Collections.Generic.List{FemDesign.Loads.LoadCase},System.Collections.Generic.List{System.Double})
Add temporary load cases and associated combination factors to the list of load cases and factors provided
temporaryLoadCases: List of temporary load cases to add
combinationType: Combination type used for the factors
loadCases: A list of load cases to add to
loadCombGammas: A list of combiation factors to add to

FemDesign.Loads.LoadCombinationTable.AddCombinationFactorLeadingAction(FemDesign.Loads.LoadGroupTemporary,FemDesign.Loads.ELoadCombinationType,System.Collections.Generic.List{System.Double})
Adds the load combination gamma factor based on the combination type
parentLoadGroup: The load group to take the coefficients from
combinationType: The type of load combination
loadCombGammas: The list of combinations factors to append to

FemDesign.Loads.LoadCombinationTable.AddCombinationFactorsAccompanyingAction(FemDesign.Loads.LoadGroupTemporary,FemDesign.Loads.ELoadCombinationType,System.Collections.Generic.List{System.Double})
Adds the load combination gamma factor based on the combination type
parentLoadGroup: The load group to take the coefficients from
combinationType: The type of load combination
loadCombGammas: The list of combinations factors to append to

FemDesign.Loads.LoadCombinationTable.FindLeadingActionName(FemDesign.Loads.LoadGroupTemporary,FemDesign.Loads.ModelLoadCaseInGroup)
Returns the leading action name or the leading load group name
parentLoadGroup: The parent load group of the leading load case
leadingLoadCase: The leading load case
Returns: The name of the leading action or load group

FemDesign.Loads.LoadCombinationTable.GetLeadingLoadCaseIndices(System.Collections.Generic.List{FemDesign.Loads.ModelLoadCaseInGroup})
Gets the indices of the leading action (0) if load case relation is alternative or the whole groups indices if load case relation is entire
loadCases: List of load cases
Returns: Returns a list of indices